{
  "homepage": "https://minecraft.curseforge.com/projects/prefab",
  "promos": {
    "1.10.2-latest": "1.1.1.16",
    "1.10.2-recommended": "1.1.1.16",
    "1.11.2-latest": "1.2.0.19",
    "1.11.2-recommended": "1.2.0.19",
    "1.12-latest": "1.3.1.7",
    "1.12-recommended": "1.3.1.7",
    "1.14-latest": "1.4.0.18",
    "1.14-recommended": "1.4.0.18",
    "1.15-latest": "1.5.0.10",
    "1.15-recommended": "1.5.0.10",
    "1.16.1-latest": "1.6.0.2",
    "1.16.1-recommended": "1.6.0.2",
    "1.16.2-latest": "1.6.1.0",
    "1.16.2-recommended": "1.6.1.0",
    "1.16.3-latest": "1.6.2.1",
    "1.16.3-recommended": "1.6.2.1",
    "1.16.4-latest": "1.6.4.3",
    "1.16.4-recommended": "1.6.4.3",
    "1.16.5-latest": "1.6.5.16",
    "1.16.5-recommended": "1.6.5.16",
    "1.17.1-latest": "1.7.1.2",
    "1.17.1-recommended": "1.7.1.2",
    "1.18.1-latest": "1.8.1.4",
    "1.18.1-recommended": "1.8.1.4",
    "1.18.2-latest": "1.8.2.2",
    "1.18.2-recommended": "1.8.2.2",
    "1.19.2-latest": "1.9.2.5",
    "1.19.2-recommended": "1.9.2.5",
    "1.19.3-latest": "1.9.3.0",
    "1.19.3-recommended": "1.9.3.0"
  },
  "1.10.2": {
    "1.1.1.10": "New Stuff: Added [Ender Gateway] structure. Added [Phasic Block] and [Boundary Block]\nSome buildings can now be generated in mod-created dimensions.",
    "1.1.1.11": "New Stuff: Added [Aqua Base] structure. Added Desert and Snowy style starting houses.",
    "1.1.1.12": "Fixes: Instant Bridge not showing preview. New Stuff: Added new language files. Starter Hosue can now be in the nether.",
    "1.1.1.13": "New Stuff: Added Grassy Plain structure.",
    "1.1.1.14": "New Stuff: Added Magic Temple structure. Fixes: Made structure generation faster, fixed villager houses.",
    "1.1.1.15": "New Stuff: Added Greenhouse, various new stairs/slabs, added starting house crafting.",
    "1.1.1.16": "Fixes: A player can generate 2 structures at same time now."
  },
  "1.11.2": {
    "1.2.0.5": "New Stuff: Added [Ender Gateway] structure. Added [Phasic Block] and [Boundary Block]\nSome buildings can now be generated in mod-created dimensions.",
    "1.2.0.6": "New Stuff: Added [Aqua Base] structure. Added Desert and Snowy style starting houses.",
    "1.2.0.7": "Fixes: Instant Bridge not showing preview. New Stuff: Added new language files. Structures with water can now be in the Nether/End.",
    "1.2.0.8": "New Stuff: Added Grassy Plain structure.",
    "1.2.0.9": "New Stuff: Added Magic Temple structure. Fixes: Made structure generation faster, fixed villager houses.",
    "1.2.0.10": "New Stuff: Added Greenhouse, various new stairs/slabs, added starting house crafting.",
    "1.2.0.11": "Fixes: A player can generate 2 structures at same time now.",
    "1.2.0.12": "Adds moderate houses. Adds compressed blocks to Ore Dictionary.",
    "1.2.0.13": "Updates Language files, fixes carpet generation, fixes green house.",
    "1.2.0.14": "Added options to Moderate House. Fixed issue with structures replacing bedrock",
    "1.2.0.15": "Added option to not include chest in mineshaft. Fixed issue with pulling items from creative menu on server",
    "1.2.0.16": "Added watch tower",
    "1.2.0.17": "Added Bulldozer, fixed phasic block and preview, changed grassy plains cleared area",
    "1.2.0.18": "Added Welcome Center, added enchanting table to Monster Masher",
    "1.2.0.19": "Enhanced the Instant Bridge to have variable length, height and materials."
  },
  "1.12": {
    "1.3.0.0": "Initial release containing latest updates from 1.2.0.10.",
    "1.3.0.1": "Fixes: A player can generate 2 structures at same time now.",
    "1.3.0.2": "Adds moderate houses. Adds compressed blocks to Ore Dictionary",
    "1.3.0.3": "Fixes game crashing issue.",
    "1.3.0.4": "Updates Language files. Fixes issues with carpet generation in Acacia house.",
    "1.3.0.5": "Fixes the green house to have more light for crops.",
    "1.3.0.6": "Fixes grassy plains crafting. Fixes crafting of certain items when playing on a server",
    "1.3.0.7": "Fixed an issue where the AquaBase wasn't craftable",
    "1.3.0.8": "Added options to Moderate House. Fixed issue with structures replacing bedrock",
    "1.3.0.9": "Added option to not include chest in mineshaft.",
    "1.3.0.10": "Updated to work for MC 1.12.2",
    "1.3.0.11": "Added watch tower.",
    "1.3.0.12": "Fixes issues with construction and preview when the Plants mod was loaded.",
    "1.3.0.13": "Added Bulldozer, fixed phasic block and preview, changed grassy plains cleared area.",
    "1.3.0.14": "Added Welcome Center, removed direction button, added enchanting table to Monster Masher.",
    "1.3.0.15": "Fixed an issue where the Monster Masher wasn't generating.",
    "1.3.0.16": "Enhanced the Instant Bridge to have variable length, height and materials.",
    "1.3.0.17": "Added Earthen Home for the Moderate House item.",
    "1.3.0.18": "Added Jungle Tree House for the Moderate House item.",
    "1.3.0.19": "Removed ores from Acacia House basement. Fixed clear space for Earthen House.",
    "1.3.0.20": "Fixed an issue with the furnace being included in a starter house when configured not to do so.",
    "1.3.0.21": "Russian translations updated. Added structure parts which is a great way to add walls, stairs and building frames!",
    "1.3.0.22": "Added Roof and Floor to Structure Part. Added Structure part to options for starting item.",
    "1.3.0.23": "Fixes an issue with the configuration for the starting item. Also adds a Chinese (Simplified) translation file.",
    "1.3.0.24": "Adds jail structure and fixes console spam issues.",
    "1.3.0.25": "Fixes the advanced warehouse recipe to use double compressed stone.",
    "1.3.0.26": "Adds saloon structure and fixes some other structure generation issues",
    "1.3.1.0": "Added a LOT of new functionality. Checkout the CurseForge release page for more information! Warning: Breaking changes ahead!",
    "1.3.1.1": "Fixed a big issue where the mod simply would not load",
    "1.3.1.2": "Fixed issues with starting houses not generating. Fixed version number in mod info. Re-vamped all blueprint screens",
    "1.3.1.3": "Item Textures have been updated. Added configuration option for water in non-overworld dimensions. Added mod specific creative tab",
    "1.3.1.4": "Fixed an issue where the bulldozer could not be enchanted in the anvil",
    "1.3.1.5": "Fixed monster masher spawns and sign. Updated checkbox texture. Added more info to unbreakable block detection. Removed excessive recipes",
    "1.3.1.6": "Added Finnish and German language support. Updated structure item icons",
    "1.3.1.7": "Added more options for instant bridge, updated villager houses, added config option for start item"
  },
  "1.14": {
    "1.4.0.0": "Initial release containing latest updates from 1.3.0.26. Added Japanese translation file. Basic starting house was updated from procedurally generated building to a static building.",
    "1.4.0.1": "Fixes a few critical defects where the game would crash when clicking on it on the Modlist screen and fixed an issue with buildings on servers.",
    "1.4.0.2": "Fixes the basic starting house and adds a new desert style house and a new sub-aquatic style!",
    "1.4.0.3": "Fixed a server error when building the villager house or instant bridge. Also fixed the structure part gui and the Aqua Base.",
    "1.4.0.4": "Fixed issues with the Horse Stable, Structure Part and Defense Bunker. Added Turkish language file. Thanks Emirhangg!",
    "1.4.0.5": "Fixed an issue with recipe registration caused by latest forge version.",
    "1.4.0.6": "Fixed an issue caused by the forge version 28.0.92 and later.",
    "1.4.0.7": "Fixed an issue caused by the recommended version of forge. This marks the first non-beta release!",
    "1.4.0.8": "Latest forge update, fixing various rendering issues and blocks not dropping themselves.",
    "1.4.0.9": "Fixing issue with glass stairs not rendering correctly when around other glass blocks.",
    "1.4.0.10": "Adding windmill and town center. Adding Chinese(Traditional), fixing various bugs",
    "1.4.0.11": "Adding config option for bulldozer to not create drops. Allow for custom bed color!",
    "1.4.0.12": "Added lantern to list of blocks to clear properly. Fixes issues with OpenJDK",
    "1.4.0.13": "Addresses an issue where the blueprints weren't respecting the vanilla spawn protected when on dedicated servers",
    "1.4.0.14": "Fixed an issue when filling the starter house chest when repurpose was also installed",
    "1.4.0.15": "Fixed an issue when filling the moderate house chest when repurpose was also installed",
    "1.4.0.16": "Updated the configuration to provide better information for the starter house options",
    "1.4.0.17": "Fixed an issue where there starter house couldn't be built",
    "1.4.0.18": "Fixes issues with infected blocks in some buildings"
  },
  "1.15": {
    "1.5.0.0": "Initial release for 1.15.2 containing the latest updates from 1.4.0.9.",
    "1.5.0.1": "Adding windmill and town center. Adding Chinese(Traditional), fixing various bugs",
    "1.5.0.2": "Adding config option for bulldozer to not create drops. Allow for custom bed color! Fixes issues with OpenJDK",
    "1.5.0.3": "Fixing issue with glass stairs not being transparent",
    "1.5.0.4": "Fixing mod not respecting vanilla spawn protection. Fixing issue when repurpose was also installed",
    "1.5.0.5": "Fixed an issue when filling the moderate house chest when repurpose was also installed",
    "1.5.0.6": "Updated the configuration to provide better information for the starter house options",
    "1.5.0.7": "Fixed an issue where there starter house couldn't be built",
    "1.5.0.8": "Fixed an issue the OpenJDK when using the Preview functionality",
    "1.5.0.9": "Fixed issues with infected blocks in some buildings",
    "1.5.0.10": "Fixed recipes to use Minecraft Tag system (old OreDictionary)"
  },
  "1.16.1": {
    "1.6.0.0": "Initial release for 1.16.1 containing the latest updates from 1.5.0.9",
    "1.6.0.1": "Added 'Warped' and 'Mountainside' Moderate houses. Added 'Cursed Tree' Nether Gate. Also fixed issue with preview when Optifine is loaded.",
    "1.6.0.2": "Fixed an issue with the saloon generating as the jail instead. Fixed some structure image dimensions so they look correct."
  },
  "1.16.2": {
    "1.6.1.0": "Initial release for 1.16.2 containing the latest updates from 1.6.0.2"
  },
  "1.16.3": {
    "1.6.2.0": "Initial release for 1.16.3 containing the latest updates from 1.6.1.0",
    "1.6.2.1": "Adds missing crafting table to Mountain Moderate House"
  },
  "1.16.4": {
    "1.6.4.0": "Initial release for 1.16.4 containing the latest updates from 1.6.2.1",
    "1.6.4.1": "Adding Creative Bulldozer",
    "1.6.4.2": "Fixed recipes to use Minecraft Tag system (old OreDictionary)",
    "1.6.4.3": "Added visual indicator of clicked block in preview and shortcut to preview to build structure"
  },
  "1.16.5": {
    "1.6.5.0": "Initial release for 1.16.5 containing the latest updates from 1.6.4.3",
    "1.6.5.1": "Fixing issue with glass panes in structures. Removed wither rose from Tree Nether Gate. Fixed default config file loading",
    "1.6.5.2": "Fixing issue where the player could generate infinite houses without losing blueprint",
    "1.6.5.3": "Adding Advanced Aqua Base and Sugar Cane Farm. Aqua Base recipe updated as it was too cheap before",
    "1.6.5.4": "Fixed item frames in structures, made workshop blueprint. Lots of config updates, see full changelog on CurseForge",
    "1.6.5.5": "Fixed issue with the workshop where it would not generate the mineshaft. Added Ukrainian language file",
    "1.6.5.6": "Added Clear glass options to some blueprints, added Sandstone and Red Sandstone to Structure Part and Instant Bridge. Fixed more Internationalization issues",
    "1.6.5.7": "Re-vamped all blueprint screens, fixed some translations, added second Acacia style house to Moderate House item, added modern buildings",
    "1.6.5.8": "Added many new items and blocks such as Swift Blades and Dirt Walls. Also added more buildings for the Modern Buildings item",
    "1.6.5.9": "Fixed infinite blueprints, fixed water in nether, fixed swift blades, updated textures, added campsite starter house",
    "1.6.5.10": "Updated compressed chest texture, added beds to villager houses, added modern tree house, add custom creative tab",
    "1.6.5.11": "Agriculture update: Added tiered farms, many new and interesting types of farms. Consolidated items. See changelog on CurseForge for more details",
    "1.6.5.12": "Fixing campsite house error, adding lights to modern tree house, fixing some reversal recipes",
    "1.6.5.13": "Instant build, build generation soud, updated checkboxes, machinery tower glass color and more! See Curseforge for full changelog",
    "1.6.5.14": "Fixed spawners and the sign on the monster masher",
    "1.6.5.15": "Added configuration option for the building sound. Fixed lecterns for the town hall. Fixed various entity generation. Fixed the bulldozer for survival mode",
    "1.6.5.16": "Added Finnish and German translations. Updated structure item textures to be up to modern styling. A number of other fixes and enhancements."
  },
  "1.17.1": {
    "1.7.1.0": "Initial release for 1.17.1 containing the latest updates from 1.6.5.11",
    "1.7.1.1": "Fixing campsite house error, adding lights to modern tree house, fixing some reversal recipes",
    "1.7.1.2": "Added configuration to determine if the building sound would play. Fixed lecturns for the town hall. Fixed various entity generation issues. Fixed the bulldozer for survival mode"
  },
  "1.18.1": {
    "1.8.1.0": "Initial release for 1.18.1 containing the latest updates from 1.7.1.2",
    "1.8.1.1": "Adding Quartz-Crete blocks (so many types....), adding restaurant and juice shop, adding modern moderate housee",
    "1.8.1.2": "Fixing item frame and painting placement. Fixing crash on dedicated server when previewing structures",
    "1.8.1.3": "Fixed issue with certain buildings generating with paintings",
    "1.8.1.4": "Added Izba starting house. Fixed Grass Wall Block connections"
  },
  "1.18.2": {
    "1.8.2.0": "Initial release for 1.18.2 containing the latest updates from 1.8.1.4",
    "1.8.2.1": "Added new starter house options, added new moderate house options, added moderate barn option, fixed bug causing players to lose structure items",
    "1.8.2.2": "Fixed issue where the moderate barn was made instead of the advanced barn"
  },
  "1.19.2": {
    "1.9.2.0": "Initial release for 1.18.2 containing the latest updates from 1.8.2.2. Also lots of new buildings and options!",
    "1.9.2.1": "Fixed some issues with dedicated servers",
    "1.9.2.2": "Fixed more issues with dedicated servers, sorry about these!!!!",
    "1.9.2.3": "Added Estate, Dark WatchTower, New Monster Masher, New Dark-Light Block and Light Switch",
    "1.9.2.4": "Glass option for instant bridge, clearer starting item config option, German translations!",
    "1.9.2.5": "Fixed issue with the mineshaft entrance not generating the mineshaft"
  },
  "1.19.3": {
    "1.9.3.0": "Initial release for 1.19.3. Added Finnish language"
  }
}
